app/Controllers/Ciudadanos.php

    public function Ciudadanos(): string
    {
        //creado un objeto de tipo RegionesModel
        $Depto = new CiudadanosModel();
        $Datos['datos']=$Depto->findAll();

        $Datos['datos']=($Depto->findAll());
---
SELECT *
FROM `ciudadanos`