app/Controllers/Departamentos.php

SELECT *
FROM `departamentos`
---
    public function departamentos(): string
    {
        //creado un objeto de tipo RegionesModel
        $Depto = new DepartamentosModel();
        $Datos['datos']=$Depto->findAll();

        $Datos['datos']=($Depto->findAll());