app/Controllers/Municipios.php

SELECT *
FROM `municipios`
---
    public function Municipios(): string
    {
        //creado un objeto de tipo RegionesModel
        $Depto = new MunicipiosModel();
        $Datos['datos']=$Depto->findAll();

        $Datos['datos']=($Depto->findAll());