app/Controllers/NivelesAcademicos.php

    public function NivelesAcademicos(): string
    {
        //creado un objeto de tipo RegionesModel
        $Depto = new NivelesAcademicosModel();
        $Datos['datos']=$Depto->findAll();

        $Datos['datos']=($Depto->findAll());
---
SELECT *
FROM `nivelesacademicos`