app/Controllers/Regiones.php

    public function Regiones(): string
    {
        //creado un objeto de tipo RegionesModel
        $region = new RegionesModel();
        $datos['datos']=$region->findAll();

        $datos['datos']=($region->findAll());
---
SELECT *
FROM `regiones`